Autodesk.Revit.Attributes.JournalingMode
All journaling modes supported by Revit external commands.
Since: 2011

Autodesk.Revit.Attributes.JournalingMode.NoCommandData
Does not write contents of the ExternalCommandData.Data map to the Revit journal.
But does allow Revit API calls to write to the journal as needed. This option should allow commands
which invoke the Revit UI for selection or for responses to task dialogs to replay correctly.

Autodesk.Revit.Attributes.JournalingMode.UsingCommandData
Uses the "StringStringMap" supplied in the command data. Hides all Revit journal entries
in between the external command invocation and the StringStringMap entry. Commands which invoke the
Revit UI for selection or for responses to task dialogs may not replay correctly.